johnR46/BellLab_STM32/USER/main.c
// SD Card global Value
int ResetAll[] = {0x57, 0xab, 0x05};
int checkConnection[] = {0x57, 0xab, 0x06, 0x57};
int setSDCard[] = {0x57, 0xab, 0x15, 0x03}; // SD Card Mode
int USBDiskMount[] = {0x57, 0xab, 0x31}; 
//int setFileName[] = {0x57, 0xab, 0x2f,0x2f,0x41,0x56,0x2E,0x54,0x58,0x54,0x00};   // 57,ab,//Filename.TXTNULL
int SF1[] = {0x57, 0xab};
char FileName[] = "//AV.TXT";
int SF2[] = {0x00};


int FileCreate[] = {0x57, 0xab, 0x34};
int FileOpen[] = {0x57,0xab,0x32};
int BYTE_WRITE[] = {0x57,0xab,0x3c,0xFF,0x00}; // >> 0x3c, dataLength,0x00 <<
int WR_REQ_DATA[] 	= {0x57,0xAB,0x2D}; // 57,AB,2D,Data
char DataToCH376[255]; // write data is 0 ot 255
int BYTE_LOCATE[] = {0x57,0xAB,0x39,0xFF,0xFF,0xFF,0xFF};
int BYTE_WR_GO[] ={0x57,0xab,0x3d};
int FileClose[] = {0x57, 0xab, 0x36, 0x01};

//int FileLength[] = {0x57, 0xab, 0x3c, 0x0d, 0x00};
int setFileNameLength = 5;

//int setFileNameA[] = {0x00, 0x57, 0xab, 0x2f, 0x2f, 0x41, 0x2e, 0x54, 0x58, 0x54, 0x00};
//int DiskconnectStatus[] = {0x00, 0x57, 0xab, 0x03}; //+
//int setAllName[] = {0x00, 0x57, 0xab, 0x2f, 0x2a, 0x2e, 0x54, 0x58, 0x54, 0x00};//*.TXT
//int setAllName2[] = {0x00, 0x57, 0xab, 0x2f, 0x41, 0x2e, 0x54, 0x58, 0x54, 0x00};//*.TXT
//int FileOpen[] = {0x57, 0xab, 0x32};
//int enumgo[] = {0x00, 0x57, 0xab, 0x33};
//int data0[] = {0x00, 0x57, 0xab, 0x27};
//int sendNull[] = {0};

//int FileUpdate[] = {0x00, 0x57, 0xab, 0x3d};

//int FilePointer[] = {0x00, 0x57, 0xab, 0x39, 0xff, 0xff, 0xff, 0xff};
//int setFileName3[] = {0x00, 0x57, 0xab, 0x2f, 0x2f, 0x59, 0x45, 0x41, 0x52, 0x32, 0x30, 0x30, 0x34, 0x00}; //A

//int FileWrite2[] = {0x00, 0x57, 0xab, 0x2d, 0x1e, 0x13, 0x0A, 0x0E, 0x20, 0x0E, 0x00, 0x01, 0x0F, 0x0F, 0x11, 0x1D, 0x19, 0x00, 0x0B, 0x0A, 0x07, 0x11};
//int FileLength2[] = {0x00, 0x57, 0xab, 0x3c, 0x12, 0x00};

/////////////////////////////////////////////////////////////////////////////////////////

int unicodeTable[] = {
  0x00, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
  0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
  0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
  /*32-47*/
  0x00, 0x2e, 0x10, 0x3c, 0x2b, 0x3f, 0x2f, 0x20, 0x37, 0x3e, 0x14, 0x16, 0x02, 0x24, 0x04, 0x32,
  /*0-9*/
  0x2c, 0x21, 0x23, 0x29, 0x39, 0x31, 0x2b, 0x3b, 0x33, 0x2a,

  0x12, 0x06, 0x30, 0x36, 0x18, 0x22, 0x5c,
  /*A-Z*/
  0x41, 0x43, 0x49, 0x59, 0x51, 0x4b, 0x5b, 0x53, 0x4a, 0x5a, 0x45, 0x47, 0x4d, 0x5d, 0x55, 0x4f,
  0x5f, 0x57, 0x4e, 0x5e, 0x65, 0x67, 0x7a, 0x6d, 0x7d, 0x75 /*Z*/,
  0x77, 0x4c, 0x7e, 0x6e, 0x78, 0x1c, /*symbol*/
  0x01, 0x03, 0x09, 0x19, 0x11, 0x0b, 0x1b, 0x13, 0x0a, 0x1a, 0x05, 0x07, 0x0d, 0x1d, 0x15, 0x0f,
  0x1f, 0x17, 0x0e, 0x1e, 0x25, 0x27, 0x3a, 0x2d, 0x3d, 0x35, /*z*/
  0x37, 0x33, 0x3e, 0x2e, 0xff /*{|}*/
};
//------------------------------------------ ch370t data ------------------------------------//'
char filelist[10][15];
int seaching = 1; //for seaching file
//-------------------------------------------------------------------------------------------//
//---------------------------------------------
#ifdef __GNUC__
/* With GCC/RAISONANCE, small printf (opti
  on LD Linker->Libraries->Small printf
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

/* Private define ------------------------------------------------------------*/
#define ADC1_DR_Address    ((u32)0x4001244C)

/* Private function prototypes -----------------------------------------------*/


///------------------------------------spi---------------------------------//
void keyboardMode(void);
void SendCommandToBLE2(int);
void Init_SPI(void);
void delay_SPI(void);
void sentdata_cell(int data);
void cell_sentdata(int cell);
uint8_t Flash_ReadWriteByte2(uint8_t data);
/*------------------------------------------------------------------------*/
void GPIO_Configuration(void);
void USART1_Configuration(void);
void USART2_Configuration(void);
void USART3_Configuration(void);
void USART3_Configuration2(void);
void UART4_Configuration(void);
void ADC_Configuration(void);
void sendUart(int);
void UARTSend(const unsigned char *pucBuffer, unsigned long ulCount);
void Uart2ReceiveKeyCode(void);
void ConnectBLE(void);
void BluetoothMode(void);
void SendCommandToBLE(int data[], int sizeOfData);

void printDot(int data[], int size);
void stringToUnicodeAndSendToDisplay(char * str);

void clearDot(void);
void menu_s(void);
void caseMenu(int);
void copy_string(char *target, char *source);


const char * fileName(void);

char DataForWrite[32] = "";
char DataForWrite_aftersort[32] = "";
const char* FileName_buffer = DataForWrite;

//--- sd card---//
void ReadFile(void);
void createFile(char *);

void searchFile(void);
void appendFile(void);
void SendCH370(int data[], int);
void changeBuatRate(void);
void keyboard(void);

// john function
void unicode_to_ASCII(void);
void notepad(void);
int mapCursor(int,int,int);
int checkBit(int);
void DataToWrite(void);
void SetFilename(void);
void FileWrite(char *name,char *str);
// gobal value int start int end



//-----------------------------------mode--------------------------------//

/* Private variables ---------------------------------------------------------*/
float AD_value;
vu16 ADC_ConvertedValue;

//------------select uart---------/

int sendUart1 = 0;
int sendUart2 = 0;
int sendUart3 = 0;
int sendUart4 = 0;

/*-----------------------------spi flash------------------------------------------*/
extern void SPI_Flash_Init(void);

extern unsigned char SST25_buffer[];
extern unsigned char SST25_buffer99[];

unsigned char SST25_buffer88[] = {0x0a, 0x0d};
/* Private define ------------------------------------------------------------*/
#define TxBufferSize1   (countof(TxBuffer1) - 1)
#define RxBufferSize1   (countof(TxBuffer1) - 1)

/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))

/* Private variables ---------------------------------------------------------*/

uint8_t TxBuffer1[] = "SPI SST25VF016B Example: This is SPI DEMO, 999888888888888888888888888888";
uint8_t TxBuffer2[] = "SPI SST25VF016B Example: This is SPI DEMO, 875217272752542452542542542542";


uint8_t NbrOfDataToTransfer1 = TxBufferSize1;
void  Delay(uint32_t nCount); //--delay spi
//GPIO_InitTypeDef GPIO_InitStructure;
int16_t USART_FLAG;

extern void SST25_W_BLOCK(uint32_t addr, u8 *readbuff, uint16_t BlockSize);
extern void SST25_R_BLOCK(uint32_t addr, u8 *readbuff, uint16_t BlockSize);


// John global Value
char str1[4096];
char str2[20];
char ch[1];
int seeCur = 0;
int mapcur = 0;
int cur = 0;
int statusmid = 0;
char strfirst[20];
char strmiddle[20];
int Curmid = 0;
char strlast[20];
int tempcur;
int mapcur1;
int mapcur2;
int lenupdate = 0;
int le = 0;
// StrData




