johnR46/BellLab_STM32/USER/main.c
/*----------------------------------------------------------------------------*/

void configFlash(void) {
  SPI_InitTypeDef  SPI_InitStructure;
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(SPI1, &SPI_InitStructure);
}
void configDisplay(void) {
  SPI_InitTypeDef  SPI_InitStructure;
  SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Tx;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Hard ;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_64;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(SPI1, &SPI_InitStructure);
}


/*******************************************************************************
  Function Name  : Main
  Description    : Main program
  Input          : None
  Output         : None
  Return         : None
  Attention      : None
*******************************************************************************/
void changeBuatRate() {
  SendCH370(changeBaudRateByte, sizeof(changeBaudRateByte));
  delay_ms(50);
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%c\r\n", i1);
  }
  printf("change 115200\r\n");
}
int main(void)
{

  /* Configure the GPIO ports */
  GPIO_Configuration();             //if config this can't use printf
  //----------------------------------------------------------------------------------------------------------
  UART4_Configuration(); //9600



  USART2_Configuration(); //115200
  USART1_Configuration(); //115200


  USART3_Configuration(); //9600



  Init_SPI();
  delay_init();
  sendUart(1);
  configDisplay();

  /*GPIO_Configuration();
    UART4_Configuration();
    USART3_Configuration();
    USART2_Configuration();
    USART1_Configuration();
    Init_SPI();
    ADC_Configuration();
    delay_init();
    sendUart(1);*/
  SPI_DISPLAY_CS_LOW();
  printDot(st_0, sizeof(st_0));
  Delay(0xffff);
  delay_ms(2000);
  printDot(st_notepad, sizeof(st_notepad));
  //stringToUnicodeAndSendToDisplay("Notepad");
  SPI_DISPLAY_CS_HIGH();


  /*
    configFlash();
    SPI_FLASH_CS_LOW();
    SST25_R_BLOCK(0x1FEFF, SST25_buffer,4096);
    printf("---test-----%s",SST25_buffer);
    SPI_FLASH_CS_HIGH();

    delay_ms(2000);
    configDisplay();
    SPI_DISPLAY_CS_LOW();
    printDot(st_bluetooth, sizeof(st_bluetooth));
    Delay(0xffff);
    SPI_DISPLAY_CS_HIGH();  */
  //delay_ms(1000);

  //Delay(0xffff);
  //configFlash();

  // for(i=0; i<4095;i++) SST25_buffer[i]='1';

  //SST25_W_BLOCK(0x0000, SST25_buffer,4096);    //写入0页的数据
  //Delay(0xffff);


  /*for(i=0; i<4095;i++) SST25_buffer[i]='2';

    SST25_W_BLOCK(0x1FEFF, SST25_buffer,4096);     //写入0页的数据
    Delay(0xffff);
  */

  //printf("---test-----");

  //SST25_R_BLOCK(0x0000, SST25_buffer,4096);
  //USART_OUT(USART1,&SST25_buffer99[0],4096);
  //printf("%s",SST25_buffer);
  //Delay(0xffff);

  //USART_OUT(USART1,&SST25_buffer88[0],2);


  //SST25_R_BLOCK(0x1F6FF, SST25_buffer99,4096);
  //USART_OUT(USART1,&SST25_buffer99[0],4096);


  /* printf("**************************************************************\r\n");
    printf("*                                                            *\r\n");
    printf("*   Thank you for using Multi Media Development Board ！^_^  *\r\n");
    printf("*                                                            *\r\n");
    printf("**************************************************************\r\n");*/
  /* Infinite loop */
  //clearDot();
  //

  //  printf("SD Card Checking");
  /*
    checkConnection[]
    setSDCard[]
    USBDiskMount[]
    setFileName
  */
  //  stringToUnicodeAndSendToDisplay("abcdef ");

  //****************** check dot****************

  printf("Status 115200 ok \r\n");
  printf("ok");
 stringToUnicodeAndSendToDisplay("APC");
  command_ = 1;
	//command_ = 1;
  while (1) {
    // keyboard();
   // notepad();
   createFile("//AV.TXT");
	// UpdateFile();
  }



}


int  mapCursor(int P1,int P2,int P3){
	if(P1!=0){
	return	checkBit(P1);
	}
	else if(P2!=0){
	return	checkBit(P2)+8;
	}
	else if(P3!=0){
	return	checkBit(P3)+16;
	}else{
	return 0;
	}
}
int checkBit(int input){
	int i;
	for(i = 0;i<=8;i++){	
				if(input==1)
				break;
				input = input>>1;
	}
	return i;
}

void notepad() {

  if (cur == 20) {
    strcat(str1, str2);
		memset(str2,'\0',strlen(str2));

    cur = 0;
		mapcur1 = 0;
    printf(" str size it  %d  is %s \n", strlen(str1), str1);

  }
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }         
                                                                           //-
		if(countKey == 2 && uart2Buffer == 0xa4){
			seeCur = 1;
		}
    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //checkKeyError
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;
 // printf("See key %x,%x,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);

    //printf("checkKey :%x\r\n",checkKeyError);
    if (checkKeyError == 0xff) { //check error key
      //printf("Key Error");
      countKey = 0;
      SeeHead = 0;
    }
		
