johnR46/BellLab_STM32/USER/main.c
    //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
    //////////////////////////////////menu selector ///////////////////////////////////

    if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
      // ---------------------------- to key code -----------------------------
      if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
        keyCode = 40; // arrow down
        // command_++;
      }
      else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
        keyCode = 55;  // arrow up
      }
    }

    if (bufferKey3digit[1] == 3  && bufferKey3digit[0] == 0) { // joy is up
      keyCode = 32;  // arrow up
    }

		if(seeCur == 1){
			mapcur = 	mapCursor(bufferKey3digit[0],bufferKey3digit[1],bufferKey3digit[2]);
				if(mapcur <=  cur){
					mapcur1 = mapcur;
					statusmid = 1;
					
			}
			else {
				
				mapcur1 = cur;
			}
		printf(" mapcur = %d \n ",mapcur1);
		
}
		
 if (bufferKey3digit[0] == 0x80 && seeCur != 1) {
			if(statusmid != 1){
			  if(cur!=0){
					str2[cur] = '\0';
        			cur--;
				}
			}
    }
		
		if ((bufferKey3digit[0] != 0 || 	keyCode == 32		)) {
			for ( i = 0; i < 255; i++) {
        if (bufferKey3digit[0]  == unicodeTable[(char) i]) {
  					if(statusmid != 1&& keyCode != 32 && bufferKey3digit[0] != 0x80  &&seeCur != 1 ){
						str2[cur] = i;
						cur++;
							}
						if(statusmid == 1  ){
								printf("cursor = %d \t mapcur1 = %d\t  \n",cur,mapcur1);
								strncpy(strfirst,str2,mapcur1);
								strncpy(strlast,str2+mapcur1,strlen(str2)- mapcur1);
								if(keyCode == 32){
						  	ch[0] = 32;					 
									mapcur1++;
									cur++;
							}
	  				if(bufferKey3digit[0] == 0x80  &&seeCur != 1){
							  ch[0] = '\0';
								if(mapcur1!=0){
									memset(strfirst + strlen(strfirst) -1,'\0',strlen(strfirst));
									cur--;
					   		  	    mapcur1--;
								}	
							}
							
							if(keyCode != 32 && bufferKey3digit[0] != 0x80  &&seeCur != 1 ){
								ch[0] = i;
								mapcur1++;
								cur++;
							}
						    	strcat(strfirst,ch);
					   		    strcat(strfirst,strlast);
						 		strcpy(str2,strfirst);
							    memset(strfirst,'\0',strlen(strfirst));
								memset(strlast,'\0',strlen(strlast));
								memset(ch,'\0',strlen(ch));
						}
						
          break;
        }
      }
			
			if(mapcur1 >= cur){
				statusmid = 0;
				}
   }
		

    if (keyCode == 32 && statusmid !=1 ) {
      str2[cur] = 32;
      cur++;
    }
		
    printf("str2: %s : len %d\r\n",str2,strlen(str2));
    stringToUnicodeAndSendToDisplay(str2);
    countKey = 0;
    keyCode = 0;
	seeCur = 0;
  }

}

void unicode_to_ASCII() {
    for ( i = 0; i < 255; i++) {
        if (bufferKey3digit[0]  == unicodeTable[(char) i]) {

        
          break;
        }
      }

}

void stringToUnicodeAndSendToDisplay(char *string) {
  int strleng = 0;
  configDisplay();
  for (j = 0; j < 20 && string[j] != '\0' && string[j] != 0x0a; j++) {
    strleng++;
  }
  printf("| %s \r\n", string);
  for (j = 20; j >= 0; j--) {
    if (j < strleng) {
      cell_sentdata(~unicodeTable[((int) * (string + j))]); //send to display
      printf(" %c unicode:%x ascii:%x lum: %d\r\n", *(string + j), unicodeTable[((int) * (string + j))], (int) * (string + j), j);
    }
    else {
      cell_sentdata(0xff); // null dot send to display
      //printf("00\r\n");
    }
  }
  //  printf("%s length: %d\r\n",string,);
}
/*void appendFile() {
  if (command_ == 1) {
    SendCH370(checkConnection, sizeof(checkConnection));
    command_++; //2
    printf("Check Connection\r\n");
  } else if (command_ == 3) {
    SendCH370(setSDCard, sizeof(setSDCard));
    printf("Set SD Card Mode\r\n");
    command_++; //4
  } else if (command_ == 5) {
    SendCH370(USBDiskMount, sizeof(USBDiskMount));
    printf(" DiskMount R:%d\r\n", command_);
    command_++; //6
  } else if (command_ == 7) {
    SendCH370(setFileName, sizeof(setFileName));
    printf("Set File Name\r\n");
    command_++; //8
  } else if (command_ == 9) {
    SendCH370(FileOpen, sizeof(FileOpen));
    printf("File Open\r\n");
    command_++; //10
  }
  else if (command_ == 11) {
    SendCH370(FilePointer, sizeof(FilePointer));
    printf("Pointer\n");
    command_++; //12
  } else if (command_ == 13) {
    SendCH370(FileLength, sizeof(FileLength));
    printf("File Length\r\n");
    command_++; //14
  }
  else if (command_ == 15) {
    SendCH370(FileWrite, sizeof(FileWrite));
    printf("File Write\r\n");
    command_++; //16
  }
  else if (command_ == 17) {
    SendCH370(FileUpdate, sizeof(FileUpdate));
    printf("File Update\r\n");
    command_++; //18
  }
  else if (command_ == 19) {
    SendCH370(FileClose, sizeof(FileClose));
    printf("File Closed\r\n");
    command_++; //20
  }
  menu_s();
  //  SendCH370(checkConnection,sizeof(checkConnection));
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%x\r\n", i1);
    if (i1 == 0xa8) {
      printf("OK\r\n");
    } else if (i1 == 0x51) {
      printf("Set SD Card OK\r\n");
    } else if (i1 == 0x14) {
      printf("Success\r\n");
    } else if (i1 == 0x82) {
      printf("Error\r\n");
    }
  }
} */

/*
void NextFile() {
  SendCH370(enumgo, sizeof(enumgo));
  //delay_ms(10);
  SendCH370(data0, sizeof(data0));
  //delay_ms(10);
  printf("Next File\r\n");
}*/

/*
void searchFile() {
  command_ = 0;
  r_count = 0;
  SendCH370(ResetAll, sizeof(ResetAll)); //reset chip
  printf("reset all\r\n");
  delay_ms(50);
  command_++;
  while (seaching == 1) {
    if (command_ == 1) {
      searchStep++;//1
      SendCH370(checkConnection, sizeof(checkConnection));
      printf("Check Connection str %s\r\n", FileName_buffer);
      command_++; //2
      delay_ms(50);
    } else if (command_ == 2) {
      searchStep++;//2
      SendCH370(setSDCard, sizeof(setSDCard));
      printf("Set SD Card Mode\r\n");
      command_++; //4
      delay_ms(50);
    } else if (command_ == 3) {
      searchStep++;//3
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf(" USB Disk Mount\r\n");
      command_++; //	
      delay_ms(50);
    } else if (command_ == 4) {
      searchStep++;//5
      SendCH370(setAllName, sizeof(setAllName));
      printf("Set File Name\r\n");
      command_++; //8
      delay_ms(50);
    } else if (command_ == 5) { ///FileOpen
      searchStep++;//6
      SendCH370(FileOpen, sizeof(FileOpen));
      printf("File Open\r\n");
      command_++; //7
      delay_ms(50);
    }
    else if (command_ == 6) {
      searchStep++;
      NextFile();
      stepCount = 0;
      countFileLegth = 0;
      command_++;
      //delay_ms(50);
    } else if (command_ == 99) {
      command_ = 6;
      searchStep = 5;
      countFileLegth = 0;
    }
    menu_s();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      //printf("%x -%d-\r\n", i1,countFileLegth);
      stepCount++;
      if (i1 == 0x42 && countFileLegth == 0) { // end file
        printf("End read %d file\r\n", r_count);
        if (r_count == 0) {
          strcpy(filelist[0], "Back and enter again");
          r_count = 1;
        }
        printf("=======================================\r\n");
        for (i = 0; i < r_count; i++) {
          printf("%s\r\n", filelist[i]);
          //stringToUnicodeAndSendToDisplay(filelist[i]);
        }
        printf("=======================================\r\n");
        //seaching = 0;
      }
      if (i1 == 0x1d && countFileLegth == 0) { // if see file
        nextAgain = 1;
        DataForWrite[0] = 42;
      }
      if ((int)i1 >= 32 && (int)i1 <= 126) {
        DataForWrite[countFileLegth] = i1;
      } else {
        DataForWrite[countFileLegth] = 42;
      }
      countFileLegth++;
      if (i1 == 0xa8) {
        printf("OK\r\n");
      } else if (i1 == 0x51) {
        printf(" Set SD Card OK\r\n");
      } else if (i1 == 0x14) {
        printf("Success\r\n");
      } else if (i1 == 0x82) {
        printf("Error\r\n");
        //strcpy(filelist[0], "Please check your SD");
        r_count = 1;
      } else if (i1 == 0xFF) {
        printf("Success\r\n");
      }
      if (searchStep == 3 && i1 == 0x82)
        printf("Not found SD-Card\r\n");
    }
    if (countFileLegth == 32) {
      strcpy(filelist[r_count], fileName());
      //copy_string(filelist[r_count],(char*)fileName());
      printf("End file this string:%s\r\n", fileName());
      while (countFileLegth > 0) {
        DataForWrite[countFileLegth--] = 0;
      }
      r_count++;
      if (nextAgain == 1) { //if have file
        nextAgain = 0;
        command_ = 99;
        //printf("Preprrrr");
      }
    }
    
