johnR46/BellLab_STM32/USER/main.c
  }
  printf("breaked\r\n");
}

*/

void copy_string(char *target, char *source) {
  while (*source) {
    *target = *source;
    source++;
    target++;
  }
  *target = '\0';
}
void writeFlash(int address, int size) {
  configFlash();
  SPI_FLASH_CS_LOW();
  SST25_W_BLOCK(address, SST25_buffer, 4096);
  //printf("---test-----%s",SST25_buffer);
  SPI_FLASH_CS_HIGH();
}
void writeFlash2(int address, int size) {
  configFlash();
  SPI_FLASH_CS_LOW();
  SST25_W_BLOCK(address, SST25_buffer99, 4096);
  //printf("---test-----%s",SST25_buffer);
  SPI_FLASH_CS_HIGH();
}
void ReadFile() { //readf
  stringToUnicodeAndSendToDisplay("Reading....");
  command_ = 0;
  r_count = 0;
  //SendCH370(ResetAll, sizeof(ResetAll)); //reset chip
  printf("reset all\r\n");
  delay_ms(50);
  command_++;
  while (readstatus == 1) {
    if (command_ == 1) {
      SendCH370(checkConnection, sizeof(checkConnection));
      command_++; //2
      delay_ms(50);
      // printf("Check Connection str %d\r\n",myFunction());
    } else if (command_ == 2) {
      SendCH370(setSDCard, sizeof(setSDCard));
      printf("Set SD Card Mode\r\n");
      command_++; //3
      delay_ms(50);
    } else if (command_ == 3) {
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf("USB Disk Mount\r\n");
      command_++; //4
      delay_ms(50);
    } else if (command_ == 4) {

      SendCH370(SF1, sizeof(SF1));
			
      printf("Set file Name\r\n");
      command_++; //5
      delay_ms(50);
    } else if (command_ == 5) { ///FileOpen
      SendCH370(FileOpen, sizeof(FileOpen));
      printf("File Open\r\n");
      command_++; //6
      delay_ms(50);

    } else if (command_ == 6) {
      SendCH370(SetByteRead, sizeof(SetByteRead)); //result 1D can read
      //printf("Check for reading File\r\n");
      command_ = 99;
      //delay_ms(50);
    } else if (command_ == 95) { //left (prevois line)
      SendCH370(continueRead, sizeof(continueRead));
      //printf("continue Read\r\n");
      command_++; //96
    }
    else if (command_ == 98) { //right (next line)
      command_ = 6;
    } else if (command_ == 99) {
      SendCH370(ReadData, sizeof(ReadData));
      // printf("Reading File\r\n");
      command_++;
    }
    menu_s();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      //printf("%x-%d\r\n", i1, i1);
      if (command_ == 96 && i1 == 0x14) {
        command_ = 6;
        printf("\r\n----------read New Sector-------------------- \r\n");
      }
      if (i1 == 0x80 || i1 == 0x14) {
        // printf("funk\r\n");
      }
      else if (command_ == 100 && countSector512 < 4 && countdataTemp512 < 512) {
        if (i1 == '\0') {
          printf("End of File\r\n");
        }
        else if (countdataTemp512 < ((128) * (countSector512 + 1)) - 1) { //128
          dataTemp512[countdataTemp512] = i1;
          countdataTemp512++;
          strLength++;
          waitEnd = 0;
          lastAscii = i1;
        } else {
          countSector512++;
          dataTemp512[countdataTemp512] = i1;
          countdataTemp512++;
          // printf("`````````````````````````one sector %d````````````````\r\n%s\r\n", countdataTemp512, dataTemp512);

          if (countSector512 >= 4) { //512

            /*dataTemp512[countdataTemp512] = i1;
              countdataTemp512++;*/
            // printf("`````````````````````````one sector````````````````\r\n%s\r\n", dataTemp512);
            // printf("---------------------------------------------------\r\n");
            command_ = 95;
            //push to flash

            for (i = addressWriteFlashTemp; i < addressWriteFlashTemp + 512; i++) {
              SST25_buffer[i - (4096 * countSector)] = dataTemp512[i - addressWriteFlashTemp];
            }
            countSector4096++;
            //writeFlash(addressWriteFlashTemp);
            addressWriteFlashTemp += countdataTemp512;
            if (countSector4096 >= 8) { // 8
              // write to flash here
              writeFlash(addressSector, 4096);
              Delay(0xffff);
              stringToUnicodeAndSendToDisplay("Reading....");
              addressSector += 4096;
              countSector4096 = 0;
              //--------------------------------------------------------------------------------------------
              //check this value `addressWriteFlashTemp`--
              //--------------------------------------------------------------------------------------------
              countSector++;
              // printf("/////////////////////////////////////////////////////%s\r\n////////////////////////", SST25_buffer);
              // printf("****************address:%d********************", addressSector);
              //while(1){}
            }
            //  printf("-------------------------%d--------------------------\r\n", addressWriteFlashTemp);

            //--- reset temp sector---//
            countdataTemp512 = 0;
            countSector512 = 0;
          } else {
            command_ = 6;
          }

          /*printf("data is :%s\r\n",dataTemp512);
            printf("----------------------------read sector------------------\r\n");*/

        }
      }/*else if(countSector512>=4){
           printf("`````````````````````````one sector````````````````\r\n%s\r\n",dataTemp512);
           printf("---------------------------------------------------\r\n");
      }*/
      if (i1 == 0xa8) {
        printf("OK\r\n");
      } else if (i1 == 0x51) {
        printf("Set SD Card OK\r\n");
      } else if (i1 == 0x14) {
        printf("Success\r\n");
      } else if (i1 == 0x82) {
        printf("Error\r\n");
      } else if (i1 == 0xFF) {
        printf("Endf\r\n");
      }
      /*if(command_==100&&i1!=0x1d){ //check continue read
        printf("Endf*************-*-*-*-*-*-*-\r\n");
        command_ = 101;
        }*/
    } else {
      if (lastAscii == i1) {
        waitEnd++;
        if (waitEnd == 100 * 100) {
          for (i = addressWriteFlashTemp; i < addressWriteFlashTemp + 512; i++) {
            SST25_buffer[i - (4096 * countSector)] = dataTemp512[i - addressWriteFlashTemp];
          }
          //
          configFlash();
          //printf("$$$$$$$$$$$$$$$$$$$$$$$$$$$addressSector:%d $$$$$$$$$$$$$$$$$$$$$$$$$\r\n", addressSector);
          writeFlash(addressSector, 4096);
          addressWriteFlashTemp += countdataTemp512;


          //addressWriteFlashTemp += countdataTemp512;


          printf("wait\r\n");
          waitEnd++;
          SPI_FLASH_CS_LOW();
          SST25_R_BLOCK(0, SST25_buffer99, 4096);
          SPI_FLASH_CS_HIGH();
          Delay(0xffff);
          // printf("``%d```````````````````````end all sector````````````````\r\n\r\n", strLength);
          //printf("%s\r\n&&&&&&&&&&&&&",SST25_buffer);
          //while(1){}

          endReadFile = 1;
          for (i = pointer22char; SST25_buffer99[i] != 0x0d; i++) {
            buffer22Char[i - pointer22char] = SST25_buffer99[i];
          }
          stringToUnicodeAndSendToDisplay(buffer22Char);
          pointer22char += 23;
          printf("\r\n----------------------end---%d-----------------------\r\n", addressWriteFlashTemp);
          AmountSector = addressWriteFlashTemp / 4096;
          AmountSectorT = addressWriteFlashTemp % 4096;
          printf("d::::%s---**\r\n", SST25_buffer99);
          while (endReadFile == 1) { //readfe
            menu_s();
          }


