johnR46/BellLab_STM32/USER/main.c
        }
      }
    }

  }
}
void SetFilename(){
	int i = 0;

	
}


void DataToWrite() {
   int i = 0;
	
   sendUart(3);
	
	
	
  for( i = 0; i < 255; i++){
		printf("%c",DataToCH376[i]);
 
  }
	



}
void FileWrite(char *name,char *str){
sendUart(1);
	

memset(DataToCH376,'\0',strlen(DataToCH376)); // clear data TO CH376
strncpy(DataToCH376,str + ,
		

  /*  SendCH370(checkConnection, sizeof(checkConnection));
    command_++; //2
    printf("Check Connection\r\n");
		delay_ms(50);
 
    SendCH370(setSDCard, sizeof(setSDCard));
    printf("Set SD Card Mode\r\n");
    command_++; //4
		delay_ms(50);
  
    SendCH370(USBDiskMount, sizeof(USBDiskMount));
    printf(" SendCommand R:%d\r\n", command_);
    command_++; //6
		delay_ms(50);
  */
	
    SendCH370(SF1, sizeof(SF1));  
		SetFilename();
		SendCH370(SF2, sizeof(SF2));
    printf("Set File Name\r\n");
    command_++; //8
		delay_ms(50);
 
    SendCH370(FileOpen, sizeof(FileOpen));
    delay_ms(50);
		SendCH370(BYTE_LOCATE, sizeof(BYTE_LOCATE)); // FF FF FF FF
			printf("File Update\r\n"); 
   
		delay_ms(500);
		command_++; //10
  
    SendCH370(BYTE_WRITE, sizeof(BYTE_WRITE));
    printf("Setting data length\r\n");
    command_++; //12
		delay_ms(500);


	
		//delay_ms(50);
    SendCH370(WR_REQ_DATA, sizeof(WR_REQ_DATA));
		
		delay_ms(500);
		DataToWrite(0,255);
	//	printf("\nWriting data\r\n");
    command_++; //14
		delay_ms(500);
  
    SendCH370(BYTE_WR_GO, sizeof(BYTE_WR_GO));
    printf("File Update\r\n");
    command_++; //16
		delay_ms(50);

 
    SendCH370(FileClose, sizeof(FileClose));
    printf("File Close\r\n");
    command_++; //18
		delay_ms(50);
 




}


void createFile(char *name) {

	memset(FileName,'\0',strlen(FileName)); // clear name
	strcpy(FileName,name);                  // set name
	  //  command_ = 1;
  if (command_ == 1) {
    SendCH370(checkConnection, sizeof(checkConnection));
    command_++; //2
    printf("Check Connection\r\n");
		delay_ms(50);
  } else if (command_ == 2) {
    SendCH370(setSDCard, sizeof(setSDCard));
    printf("Set SD Card Mode\r\n");
    command_++; //4
		delay_ms(50);
  } else if (command_ == 3) {
    SendCH370(USBDiskMount, sizeof(USBDiskMount));
    printf(" SendCommand R:%d\r\n", command_);
    command_++; //6
		delay_ms(50);
  } else if (command_ == 4) {
    SendCH370(SF1, sizeof(SF1));
		sendUart(3);
		for( i = 0; i<strlen(FileName); i++){
		printf("%c",FileName[i]);
   }
		sendUart(1);
		SendCH370(SF2, sizeof(SF2));
    printf("Set File Name\r\n");
    command_++; //8
		delay_ms(50);
  } else if (command_ == 5) {
    SendCH370(FileCreate, sizeof(FileCreate));
    // SendCH370(FileClose,sizeof(FileClose));
    printf("File Create\r\n"); //FileClose
		//  delay_ms(50);
		//  SendCH370(BYTE_LOCATE, sizeof(BYTE_LOCATE));
   
		delay_ms(500);
		command_++; //10
  } 
	//else if (command_ == 6) {
  //  SendCH370(BYTE_WRITE, sizeof(BYTE_WRITE));
   // printf("Setting data length\r\n");
   // command_++; //12
		//delay_ms(50);
  //}
 // else if (command_ == 7) {
	//	DataToWrite();
  //  SendCH370(WR_REQ_DATA, sizeof(WR_REQ_DATA));
	//	DataToWrite();
	//	printf("Writing data\r\n");
    //command_++; //14
	//	delay_ms(200);
 // } else if (command_ == 8) {
  //  SendCH370(BYTE_WR_GO, sizeof(BYTE_WR_GO));
  //  printf("File Update\r\n");
   // command_++; //16
	//	delay_ms(50);
 // }
  else if (command_ == 6) {
    SendCH370(FileClose, sizeof(FileClose));
    printf("File Close\r\n");
    command_++; //18
		delay_ms(50);
  }
	
	 else if (command_ == 7) {
    UpdateFile();
		  printf("File update complete\r\n");
  }
	
  menu_s();
  //  SendCH370(checkConnection,sizeof(checkConnection));
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%x\r\n", i1);
    if (i1 == 0xa8) {
      printf(" status OK\r\n");
    } else if (i1 == 0x51) {
      printf(" Set SD Card OK\r\n");
    } else if (i1 == 0x14) {
      printf(" Mount Success\r\n");
    } else if (i1 == 0x82) {
      printf(" Mount Error\r\n");
    }
  } //checkConnection
}
const char * fileName()
{
  int loop = 0;
  int count_char = 0;
  int seeT = 0;
  for (loop = 0; loop < 32; loop++) {
    if (((int)DataForWrite[loop] >= 33 && (int)DataForWrite[loop] <= 126) && DataForWrite[loop] != 42 && loop < 12) { //end of 12
      DataForWrite_aftersort[count_char] = DataForWrite[loop];
      count_char++;
    }
  }
  while (count_char < 32) {
    DataForWrite_aftersort[count_char] = 0;
    count_char++;
  }
  count_char = 0;
  while (DataForWrite_aftersort[count_char] != '\0') {
    if (DataForWrite_aftersort[count_char] == 'T' && seeT == 0) {
      if (DataForWrite_aftersort[count_char + 1] == 'B' && DataForWrite_aftersort[count_char + 2] == 'T') {
        seeT = 1;
        DataForWrite_aftersort[count_char] = '.';
        DataForWrite_aftersort[count_char + 1] = 'T';
        DataForWrite_aftersort[count_char + 2] = 'B';
        DataForWrite_aftersort[count_char + 3] = 'T';
        count_char += 3;
      }
    } else if (seeT || DataForWrite_aftersort[count_char] == 42) {
      DataForWrite_aftersort[count_char] = 0;
    }
    count_char++;
  }
  if (seeT == 1) {
    printf("this's tbt file\r\n");
  }
  return DataForWrite_aftersort;
}
void menu_s() {
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }                                                                       //-

    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //checkKeyError
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;
    printf("See key %x,%d,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);
    //printf("checkKey :%x\r\n",checkKeyError);
    if (checkKeyError == 0xff) { //check error key
      //printf("Key Error");
      countKey = 0;
      SeeHead = 0;
    }
    printf("current mode:%d\r\n", mode);
    //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
    //////////////////////////////////menu selector ///////////////////////////////////
    if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
      // ---------------------------- to key code -----------------------------
      if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
        keyCode = 40; // arrow down
        // command_++;
      }
      else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
        keyCode = 55;  // arrow up
      }
      else if (bufferKey3digit[1] == 128 || bufferKey3digit[2] == 0x10) { // joy is up
        keyCode = 38;  //
        //  command_=8;
      }
      else if (bufferKey3digit[1] == 64 || bufferKey3digit[2] == 8) {
        keyCode = 13; // enter
      }
      else if (bufferKey3digit[1] == 32 || bufferKey3digit[2] == 4) {
        keyCode = 8; // backspace
        ///command_ = 99;
      }
      else if (bufferKey3digit[1] == 4 ) {
        keyCode = 38; // left
        //  command_ = 97;
        //command_ = 95; //before delete
      }
      else if (bufferKey3digit[1] == 8) {
        keyCode = 40; // right
        // command_ = 98;
      }
      if (bufferKey3digit[0] == 0x9f) {
        printf("new Folder\r\n");
      }
    }

