johnR46/BellLab_STM32/USER/main.c
    //---------------------------------end joy event--------------------------------
    ////////////////////////////////////////////////////////////////////////////////
    //                                                                            //
    //                                                                            //
    //------------------------------- mode selector --------------------------------
    //                                                                            //
    //                                                                            //
    ////////////////////////////////////////////////////////////////////////////////
    //------------------------------- mode (1) -------------------------------------
    if (count_menu >= 1 && count_menu <= maxMenu && mode == 0) { //select menu //modemenu
      if (keyCode == 40) { //up
        if (count_menu != maxMenu) {
          count_menu++;
        }
      }
      else if (keyCode == 38) { //down
        if (count_menu != 1) {
          count_menu -= 1;
        }
      }
    }
    // --------------------------- end mode (1) -----------------------------
    if (count_menu >= 1 && count_menu <= maxMenu && mode == 1) {

    }
    // ----------------------------- mode (5) -------------------------------
    if (count_menu >= 1 && count_menu <= maxMenu && mode == 5) {
      printf("bluetooth Mode\r\n");
    }
    // ----------------------------- end mode (5) ---------------------------
    if (keyCode == 8) { // enter mode && previousMode != mode
      if (mode == 3 && openFileStatus == 1) {
        command_ = 0;
        seaching = 1;
        //mode = 0;
        openFileStatus = 0;
        readstatus = 0;
      } else if (mode == 3) {
        command_ = 0;
        seaching = 0;
        mode = 0;
      }
      else {
        mode = 0;
      }
      printf("back c = %d mode = %d\r\n", command_, mode);
    } // back
    if (keyCode == 13) { //enter
      //  previousMode
      if (mode == 0) { //on menu
        previousMode = mode;
        mode = count_menu;
        printf("enter mode(%d)\r\n", count_menu);
        if (mode == 3) {
          seaching = 1;
          countMenuInReadMode = 0;
        }
      } else if (mode == 3 && endReadFile != 1) { //openf
        strcpy(prepareNameToOpen, filelist[countMenuInReadMode - 1]);
        printf("Open %s\r\n", prepareNameToOpen);
        i = 0;
        setFileNameLength = 5;
        while (prepareNameToOpen[i] != '\0') {
          setFileNameLength++;
        //  setFileName[i + 5] = (int)prepareNameToOpen[i];
       //   printf("- %x ", setFileName[i + 5]);
          i++;
        }
        setFileNameLength++;
     //   setFileName[i + 5] = 0x00;
        i = 0;
        seaching = 0;
        openFileStatus = 1;
        readstatus = 1;
      }
    }

    /////////////////////////////// --- end mode --- ////////////////////////////////
    printf("%d\r\n", count_menu); //mode menu
    // -----------------------  visible menu with braille display ---- Mode (1) -----
    switch (mode) { //in list menu mode
      case 0:
        caseMenu(count_menu);
        break;
      case 3: //mode 3 read mode

        if (endReadFile != 1) {
          if (keyCode == 38) { //up
            if (countMenuInReadMode > 1) {
              countMenuInReadMode -= 1;
            }
          } else if (keyCode == 40) { //down
            if (countMenuInReadMode != r_count) {
              countMenuInReadMode += 1;
            }
          }

          if (countMenuInReadMode == 0) {
            stringToUnicodeAndSendToDisplay("Read mode");
            printf("******print (Read mode) to dot *********\r\n");
          } else {
            stringToUnicodeAndSendToDisplay(filelist[countMenuInReadMode - 1]);
            printf("******print (%s) to dot ********\r\n", filelist[countMenuInReadMode - 1]);
          }   //prepareNameToOpen
        } else {
          if (keyCode == 38 || keyCode == 40 && endReadFile == 1) { //readfg

            for (i = pointer22char; i < (pointer22char + 22 < addressWriteFlashTemp ? pointer22char + 22 : addressWriteFlashTemp - pointer22char) && SST25_buffer99[i] != 0x0a ; i++) {
              if (SST25_buffer99[i] != NULL) {
                buffer22Char[i - pointer22char] = SST25_buffer99[i];
                printf("%c/", SST25_buffer99[i]);
              }
            }

            stringToUnicodeAndSendToDisplay(buffer22Char);
            printf("send: %d %s -\r\n", pointer22char, buffer22Char);
            if (keyCode == 40) {
              /* if(pointer22char+22<4096&&pointer22char<addressWriteFlashTemp){
                pointer22char+=22;
                }else{
                pointer22char+=4096-pointer22char;
                }*/
              /*
                countSector
                pointer22char
                addressWriteFlashTemp
              */

            } else if (keyCode == 38) {
              if (pointer22char >= 22) {
                pointer22char -= 22;
              }
            }

            //buffer22Char[]
            /*for(i = 0; i < countSector+1;i++){ //----------------end read file form rom-------------------
              SPI_FLASH_CS_LOW();
              SST25_R_BLOCK(i*4096, SST25_buffer99, 4096);
              SPI_FLASH_CS_HIGH();
              Delay(0xffff);
              if(i==countSector){
                  for(j=0;j<(addressWriteFlashTemp-(countSector*4096))-1;j++){
                    printf("%c",SST25_buffer99[j]);
                  }
                  //printf("12121212121212121212end @@@@@@@@@@@@@@@@@@@\r\n");
              }
              else{
                  printf("%s\r\n---------------------------------------\r\n",SST25_buffer99);

              }
              //for(i=0;i<countdataTemp512;i++){
              //printf("---asd-%s", SST25_buffer99);
              }//
            */
          }
        }
        break;
      case 5:
        stringToUnicodeAndSendToDisplay("STM Braille SLRI");
        break;
    }
    //------------------------------ end case menu ------------------------
    countKey = 0;
    keyCode = 0;
  }
}
void keyboard() {
  if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    //----------------------------- uart to key--------------------------------
    uart2Buffer = USART_ReceiveData(USART2);                                //-
    if (uart2Buffer == 0xff && SeeHead == 0) {                              //-
      SeeHead = 1;                                                          //-
      countKey = 0;                                                         //-
    }                                                                       //-

    if (countKey >= 4 && countKey <= 6) {                                   //-
      bufferKey3digit[countKey - 4] = uart2Buffer;                          //-
    }
    if (countKey == 2) //checkKeyError
    {
      checkKeyError = uart2Buffer;
    }
    countKey++;
    // ---------------------------- end uart to key ----------------------------
    // printf("[%x]\r\n",uart2Buffer);
  }
  if (countKey >= maxData) { //Recieve & checking key
    seeHead = 0;
    printf("See key %x,%d,%x\r\n", bufferKey3digit[0], bufferKey3digit[1], bufferKey3digit[2]);

    //printf("checkKey :%x\r\n",checkKeyError);
    if (checkKeyError == 0xff) { //check error key
      //printf("Key Error");
      countKey = 0;
      SeeHead = 0;
    }
    //printf("%d\r\n",sizeof(mode_1)/sizeof(int));
    //////////////////////////////////menu selector ///////////////////////////////////
    if (bufferKey3digit[1] != 0 || bufferKey3digit[2] != 0) { //joy menu
      // ---------------------------- to key code -----------------------------
      if (bufferKey3digit[2] == 1 || bufferKey3digit[2] == 0x20) { // joy is down
        keyCode = 40; // arrow down
        // command_++;
      }
      else if (bufferKey3digit[1] == 1 || bufferKey3digit[1] == 3 || bufferKey3digit[1] == 2) { // joy is up
        keyCode = 55;  // arrow up
      }
    }
    if (sizeof(bufferKey3digit[0] != 0)) {
      for ( i = 0; i < 255; i++) {
        if (bufferKey3digit[0] == unicodeTable[(char) i]) {
          printf("%c", i);
          break;
        }
      }
    }
    countKey = 0;
    keyCode = 0;
  }
}
void caseMenu(int count_menu) {
  switch (count_menu) {
    case 1:
      printDot(st_notepad, sizeof(st_notepad));
      break;
    case 2:
      printDot(st_filemanage, sizeof(st_filemanage));
      break;
    case 3:
      printDot(st_read, sizeof(st_read));
      break;
    case 4:
      printDot(st_usbconnect, sizeof(st_usbconnect));
      break;
    case 5:
      printDot(st_bluetooth, sizeof(st_bluetooth));
      break;
    case 6:
      printDot(st_clock, sizeof(st_clock));
      break;
    case 7:
      printDot(st_calcu, sizeof(st_calcu));
      break;
    case 8:
      printDot(st_tools, sizeof(st_tools));
      break;
  }
}

void printDot(int data[], int size) {
  int tsize = size / sizeof(int);
  //  printf("%d", sizeof(testarray[0]) / sizeof(int));
  for (j = 20; j >= 0; j--) {
    if (j < tsize)
      cell_sentdata(~data[j]);
    else
      cell_sentdata(0xff); // null dot
  }

